{
    "CHANGING THE ACCOUNT MAIL FOR PRODUCTION AND COMMERCIAL": "CHANGING THE ACCOUNT MAIL FOR PRODUCTION AND COMMERCIAL\nLaunch the PUTTY\n              Enter the hostname/IP address of the server and click Open.\n              When prompted, enter your username and password to log in.\n             After logging in, run the following command to switch to the sas user\n             su – sas\nConnect to mdb with con 706 cn\nRun the SELECT query and check previous data\nselect * from mdb_config\nwhere key_name in ('production_account_mail', 'commercial_account_mail')\ncheck the output if new mail and old mail is same, then no need to do any changes.\nIf the output and new mail is different we need to change.\nAdd new email and airline code in the script.\nNow Change directory using \nCd Anand fargose \nls -ltr (now we can see the ‘add_prod_email’)\nwe can change to this directory using \ncd add_prod_email\nnow create new directory with qms no to identify easily.\nMkdir qms no\nCd qms no\nCreate new script file\nCat > script.sh\nEnter the script \nrm -rf $0_traza $0_bds\necho \"\nunload to $0_bds delimiter ' '\n  select unique trim(dbname)||'@'||trim(dbserver) db from cdb_connection\n      where afv_daily_enviroment='N'\n      and upper(business_id) not like '%TEST%'\n         and airline_code in ('180')\n\">$0_crear.sql\ndbaccess cdb_support@afv2tcp_repr $0_crear.sql\nwhile read a\ndo\n        echo $a >>$0_traza\necho \"\nupdate mdb_config set key_value='joyce.furtado@accelya.com'\nwhere key_name='production_account_mail';\nupdate mdb_config set key_value='joyce.furtado@accelya.com'\nwhere key_name='commercial_account_mail';\n\">$0_loadmdb.sql\n        dbaccess $a $0_loadmdb.sql 2>>$0_traza\nrm -rf $0_loadmdb.sql\ndone<$0_bds\n#mutt -s \"replace_email_047\" anand.fargose@accelya.com -a $0_traza <$0_traza\nrm -rf $0_crear.sql\nenter (ctrl + d)\nGive execute permission\nchmod +x script.sh\nRun the script in the background\nNohup  ./script.sh &\nCheck if the script is running \nJobs\nTo view the output check output file \nCat nohup.out",
    "BAED RECALULATION": "BAED RECALULATION\nLaunch PuTTY on your machine.\nConnect to the host (vlrdpc26) \nLog in with your credentials (username/password or key).\nConnect to MDB (con 957 BR)\nBefore making any changes, you need to check the current BAED. By using this query.\nselect std_non_modify.trnn,std_non_modify.document,std_non_modify.id_file,\nstd_non_modify.baed\nfrom\nstd_non_modify, hot_bkt06, special_data\nwhere\nstd_non_modify.id_file=hot_bkt06.id_file\nand std_non_modify.baed=hot_bkt06.baed\nand std_non_modify.trnn=hot_bkt06.trnn\nand std_non_modify.id_file=special_data.id_file\nand std_non_modify.baed=special_data.baed\nand std_non_modify.trnn=special_data.trnn\nand special_data.verification_level=1\n--and in_scope='Y'\nand transaction_code in ('TKTT')\nand std_non_modify.document in(\n'1001536532')\nRun the SELECT query. You need to replace document_number and transaction_code with values from QMS. Run this query.\nset isolation to dirty read;\nselect std_non_modify.trnn,std_non_modify.document,std_non_modify.id_file,\nstd_non_modify.baed\nfrom\nstd_non_modify, hot_bkt06, special_data\nwhere\nstd_non_modify.id_file=hot_bkt06.id_file\nand std_non_modify.baed=hot_bkt06.baed\nand std_non_modify.trnn=hot_bkt06.trnn\nand std_non_modify.id_file=special_data.id_file\nand std_non_modify.baed=special_data.baed\nand std_non_modify.trnn=special_data.trnn\nand special_data.verification_level=1\n--and in_scope='Y'\nand transaction_code in ('TKTT')\nand std_non_modify.document in(\n'1001536532',\n)\ninto temp supp_anand_temp\nRun INSERT Query. It will show the output number of rows are inserted.\ninsert into recalc_baed_log (id_file, trnn, baed)\n           select snm.id_file, snm.trnn, snm.baed \n           from std_non_modify snm, supp_anand_temp ot, special_data sd\n           where snm.trnn = ot.trnn\n           --and sd.real_status_final != 5\n           and sd.verification_level = 1\n           and sd.id_process is null\n           and snm.id_file = sd.id_file\n           and snm.trnn = sd.trnn\n           and snm.baed = sd.baed\n           --and in_scope='Y'\n           and transaction_code in ('TKTT')\nOutput: -\n(0) rows inserted\n→ Something is wrong. No data was inserted.\n(1) rows inserted\n→ Data insertion successful.\nAfter successful insertion. Exit the MDB session\nNow you need to run the Cambiar script and make changes out side the mdb.\nModify these parameters:\nMDB Account Name\nBAED value (as per QMS)\ncambiar_baed_2021.sh db name and date\nAfter Cambiar completes successfully. Reconnect to MDB. (con 957 BR)\nNow insert the final BAED update using the updated values from QMS.\nModify and run the same INSERT query with the final BAED values.\nAgain, check that rows are inserted successfully.\nset isolation to dirty read;\ninsert into hot_bch02\nselect unique id_file  ,  pdai   ,pcyc, '11/25/2024', dyri,  resd , linea from hot_bch02\nwhere id_file in  (select unique id_file from recalc_baed_log where baed_new ='20241125')\nand id_file not in (select bbb.id_file from hot_bch02 bbb  where bbb.baed='11/25/2024')\nverify that the BAED has been updated correctly by using select query.",
    "Letter of Authorization": "Letter of Authorization\nTo whomsoever it may concern\nI understand that Accelya may use an outside agency to verify and validate the information I have provided including my employment, my personal background, professional standing, work history and qualifications.\nI understand that an outside background agency may obtain information it deems appropriate from various sources including, but not limited to, the following: current and past employers, criminal conviction records, school records, College records and professional and personal references.\nI authorize, without reservation, any individual, corporation or other private or public entity to furnish Accelya and the outside background agency all information about me.\nI unconditionally release and hold harmless any individual, corporation, or private or public entity from any and all causes of action that might arise from furnishing to Accelya and the outside agency information that they may request pursuant to this release.\nThis authorization and release, in original, faxed or photocopied form, shall be valid for this and any future reports and updates that may be requested.\nName:  Nikhil Arella\nSign: \n      Date: 26/05/2025 ",
    "M": "Declaration of conflict of interest\nName:\nID number:\nI declare:\n☑\tNO\tI do not have any family relationship, friendship or commercial, direct or indirect relationship with any worker of Accelya, including its administrators and direct personnel, that could be considered as a conflict of interest.\n\tYES I do have any family relationship, friendship or commercial, direct or indirect relationship with any worker of Accelya, including its administrators and direct personnel, that could be considered as a conflict of interest.\nName of the employee I know: \t  Position of the employee I know: \t Type of relationship: \t\t\nThis declaration, in way or form, will influence (positively or negatively) the final decision of our recruiting process. This form is excluded from the hiring decision; it is intended for record keeping and reference purposes only.\nDate and Signature: 2222222222222226/05/2025",
    "Nikhil Arella": "Nikhil Arella\nProduction Support  Engineer\nEmail: nikhilarella84999@gmail.com\nMobile No:+91- 8317638526\nCareer objective:\nLooking forward for challenging and rewarding position as a Support Analyst with state-of-art technology where my analytical, trouble shooting skills, experience in business process knowledge can be put in for the successful execution of the projects in both implementation as well as the supporting projects.\nEducation Details:\nCompleted Degree from (Osmania University) in the year 2019 with 6.56CGPA.\nCompleted Inter from Shree Bharathi Junior College with 78%.\nCompleted SSC from Krishnaveni Talent School. \nProfessional Summary:\nTotal 3.5+ years of experience in L2 production Support.\nHaving good experience in Oracle with UNIX Production and Application Support.\nSupporting Experience on Oracle with UNIX and Windows servers.\nAnalysis and Troubleshooting of issues in Production environment and resolve the issues.\nEnhanced the existing UNIX scripts to achieve better performance and throughput.\nGood in writing complex SQL queries according to business rules.\nHaving good experience in Autosys, and Cron tab scheduler to schedule the jobs.\nHaving good experience in Data bases like ORACLE.\nGood experience in Migrations and Deployments in production servers.\nGood understanding of ITIL 4 lifecycles and processes.\nGood experience in planning and implementing DR/Business Continuity Test on quarterly and yearly basis. \nSupport of daily operations including job monitoring and troubleshooting of the 24x7 production.\nClosely worked with Developers and Analysts to address project requirements. Able to effectively manage time and prioritize multiple projects.\nExcellent communication, team membership and relationship management skills.\nTechnical Skills:\nVersion Control\t\t\t: Git Hub\nBuild Tools\t\t\t: TeamCity, Jenkins & UCD\nTicketing Tools\t\t\t: ServiceNow, BMC Remedy & JIRA\nDatabase\t\t\t: Oracle, MSSQL & MySQL\nTools\t\t\t\t: Putty, Tectia, SQL Developer, Splunk, Kibana, Jenkins, Autosys, JIRA\nServer Operating System\t\t: LINUX , Unix & Windows\nWork Experience:\nWorking as a Production Support Engineer in Global Software, Mumbai from Nov 2021 to Till date. \nProject Details:\nProject#1 \nProject Name\t        :         Paddle    \nClient\t\t         :        BNP Paribas\nCompany\t:\tGlobal Software, Mumbai\nRole\t:\tProduction Support Engineer\nDuration\t:\tNov 2021 To till date\nDescription:\nPaddle project includes OCR & C2P to imaging application, which will help users to capture  the information that is being scanned and capture important based on the docs scanned that will help on the information from the scanned prints to identify the persons background who have involved in transactions to check if the person has any illegal identity.\nRoles and Responsibilities:\nDaily BAU activity Support.\nJob Scheduling Using CA workload autosys in UNIX\nMonitoring the application through Scheduler and monitoring of the log.\nFull time support on and sending the daily system health checks.\nProvided constant technical support for applications to ensure optimal durability and\n                reliability - Investigated and resolved technical operational issues of the applications.\nWorked with other support teams to resolve issues on downstream applications.\nIncident management and resolution of any problems on production applications.\nAnalysis and Resolution of Prod & Development issues.\nAttended daily client calls on daily basis to update the status of the on-going issues.\nWell versed, working with Domestic and International Clients for Project Deliveries\n               and Client interaction.\nDocumenting Test-cases for the application and execution of the test cases during every release and for Regression.\nPreparing BIRD Documents and recording the failures and success cases through HP\n                Quality center.\nInvolved in analysis, investigation, support and maintenance activities.\nAttended client calls to update the status of the project and to check and help to solve the issues.\nMonitoring software release, deployments & environments.\nAnalysis and Resolution of L2 issues.\nRunning different events and EODs whenever the request comes.\nSupport Server maintenance activities.\nFull time support on and sending the daily system health checks.\nProvided constant technical support for applications to ensure optimal durability and reliability - Investigated and resolved technical operational issues of the applications.\nWorked with other support teams to resolve issues on downstream applications.\nIncident management and resolution of any problems on production applications.\nworking on User queries and Data Extractions.\nProvide on-going operational support including release, upgrade, bug fixing and any system change activities.\nUsed to raise CMP request to on-board the Fids and get public & Private key.\nFeedback management to both internal and external customers depending upon requirement\nEnsure proper follow up and closure of issues\nKeep abreast of the team’s performance and ensure services are delivered in line with SLAs\nEnsure overall team load is balanced and cases are assigned to consultants based on capacity and skill sets.\nRetrieves the data from Database with help of the SQL queries for further investigation\nWorked with changing or modifying the properties in Application whenever the request is raised by the client which in turn reflects the clients Websites.\nCo-ordinating with different teams during issues and deployments.\nUsing Confluence pages for documenting.\nDECLARATION:\nI hereby declare that the above-mentioned information is correct up to my knowledge and I bear the responsibility for the correctness of the above-mentioned particulars. \nMumbai\t\t\t\t\t\t\t\t\t\t\tNIKHIL A"
}